/*
Copyright (c) 2025 Tearnote (Hubert Maraszek)

Licensed under the Mozilla Public License Version 2.0 <LICENSE-MPL-2.0.txt
or https://www.mozilla.org/en-US/MPL/2.0/> or the Boost Software License <LICENSE-BSL-1.0.txt
or https://www.boost.org/LICENSE_1_0.txt>, at your option. This file may not be copied, modified,
or distributed except according to those terms.
*/

#pragma once

#include "preamble.hpp"

namespace playnote::gfx {

static inline constexpr auto AtlasPrewarmChars = to_array({
// Latin alphanumerics
"abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789"sv,
// Latin punctuation
" !@#$%^&*()_+=-[]{};':\",./\\<>?`~|"sv,
// Latin supplement
"¡¢£¤¥¦§¨©ª«¬®¯°±²³´µ¶·¸¹º»¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõö÷øùúûüýþÿ"sv,
// Fullwidth alphanumerics
"ＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚ０１２３４５６７８９"sv,
// Fullwidth punctuation
"、。，．・：；？！゛゜´｀¨＾￣＿ヽヾゝゞ〃仝々〆〇ー―‐／＼～∥｜…‥‘’“”（）〔〕［］｛｝〈〉《》「」『』【】＋－±×÷＝≠＜＞≦≧∞∴♂♀°′″℃￥＄￠￡％＃＆＊＠§☆★○●◎◇◆□■△▲▽▼※〒→←↑↓〓"sv,
// Hiragana
"ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをんゔ"sv,
// Katakana
"ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴヵヶ"sv,
// Hangul
"가각간갇갈갉갊감갑값갓갔강갖갗같갚갛개객거건걷걸검겁것게겨격겪견결겸겹경계고곡곤곧골곰곱곳공과관광괘괴굉교구국군굳굴굵굼굽궁권궤귀규균그극근글긁금급긋긍기긴길김깁깃깊까깎깐깔깜깝깡깨깰꺼꺾껄껌껍껏껑께껴꼬꼭꼴꼼꼽꽁꽃꽈꽉꽤꾸꾹꾼꿀꿇꿈꿉꿍끄끈끊끌끓끔끙끝끼끽낀낄낌낑"sv,
"나낙낚난날낡남납낫났낭낮낯낱낳내냄냇냉냐냥너넉넋넌널넓넘넙넣네넥넷녀녁년념녕노녹논놀놈농높놓놔뇌뇨누눅눈눌눕눠뉘뉴늉느늑는늘늙늠능늦늪니닉닌닐님닙닛닝"sv,
"다닥닦단닫달닭닮담답닷당닿대댁더덕던덜덟덤덥덧덩덮데델도독돈돌돔돕동돼되된될됨두둑둔둘둠둡둥뒤뒷드득든듣들듦듬듭듯등디딕딘딜딤딥딧딩따딱딴딸땀땋때땜떠떡떤떨떻떼또똑뚜뚫뚱뛰뜨뜩뜯뜰뜸뜻띄"sv,
"라락란랄람랍랏랐랑랗래랙랜랠램랩랫랬랭랴략량러럭런럴럼럽럿렀렁렇레렉렌렐렘렙렛렜렝려력련렬렴렵렷렸령례로록론롤롬롭롯롱롸뢰료루룩룬룰룸룹룻룽뤄류륙률륭르륵른를름릅릇릉릊릍릎리릭린릴림립릿링"sv,
"마막만많맏말맑묽맘맙맛망맞맡맣매맥맨맬맴맵맷맹맺머먹먼멀멈멉멋멍멎메멘멩며멱면멸명몇모목몫몬몰몸몹못몽뫼묘무묵묶문묻물뭄뭅뭇뭉뭐뭘뭣므미믹민믿밀밈밉밋밍밑"sv,
"바박밖반받발밝밟밤밥밧방밭배백뱀뱃뱅버벅번벌범법벗벙베벤벨벼벽변별볍병볕보복볶본볼봄봅봇봉봐뵈뵙부북분불붉붐줍붓붕붙뷰브블비빅빈빌빔빕빗빙빚빛빠빡빨빵빼뺌뻐뻔뻗뻘뻣뼈뼉뽀뽑뽕뿌뿐뿔뿜쁘쁜쁠쁨삐"sv,
"사삭산살삶삼삽삿샀상새색샌샐샘샛생서석섞선설섬섭섯성세섹센셀셈셉셋셍셔션셜셤셥셧셨셩셰소속손솔솜솟송쇄쇠쇼수숙순술숨숫숭숲쉬쉰쉽슈스슥슨슬슴습슷승시식신실싫심십싯싱싶싸싹싼쌀쌈쌉쌍쌓쌔써썩썬썰썸썹썼썽쏘쏙쏜쏟쏠쏨쏴쐐쑤쑥쓰쓴쓸씀씌씨씩씬씰씸씹씻"sv,
"아악안앉않알앎앓암압앗았앙앞애액야약얀얄얇얌양얕얗얘어억언얹얻얼얽엄업없엇었엉엊엌엎에엔엘여역엮연열엷염엽엿였영예오옥온올옮옳옴옵옷옹와완왕왜왠외왼요욕용우욱운울움웁웃웅워원월웨웬위윗유육율융으윽은을읊음읍읏응의이익인일읽잃임입잇있잉잊잎"sv,
"자작잔잖잘잚잠잡잣장잦재쟁저적전절젊점접젓정젖제젠젯져젼조족존졸좀좁종좋좌죄주죽준줄줌줍줏중쥐즈즉즌즐즘즙증지직진질짊짐집짓징짖짜짝짠짤짧짬짭짱째쩌쩍쩐쩔쩜쩝쩡쪼쪽쫓쭈쭉찌찍찐찔찜찝찡"sv,
"차착찬찮찰참찹찻창찾채책챈챌챔챕챗챙처척천철첨첩첫청체쳐촌총촬최추축춘출춤춥춧충춰취츠측츨츰층치칙친칠침칩칫칭카칵칸칼캄캅캇캉캐캔캘캠캡캣캥커컥컨컬컴컵컷컹케켓켜코콕콘콜콤콥콧콩콰쾌쿠쿡쿤쿨쿰쿱쿵크큰클큼큽킁키킥킨킬킴킵킷킹"sv,
"타탁탄탈탉탐탑탓탕태택탠탤탬탭탯탱터턱턴털텀텁텃텅테텍텐텔템텝텟텡텨토톡톤톨톰톱톳통퇴투툭툰툴툼툽툿퉁튀튜트특튼틀틈티틱틴틸팀팁팃팅"sv,
"파팍팎판팔팜팝팟팡팥패팩팬팰팸팹팻팽퍼퍽펀펄펌펍펏펑페펙펜펠펨펩펫펭펴편펼평폐포폭폰폴폼폽폿퐁표푸푹푼풀품풉풋풍퓨프픈플픔피픽핀필핌핍핏핑"sv,
"하학한할핥함합핫항해핵핸햄햇행향허헉헌헐험헙헛헝헤헥헨헬헴헵헷헹혀혁현혈혐협혓혔형혜호혹혼홀홈홉홋홍화확환활황홰횃회획횟횡효후훅훈훌훑훔훗훙훨휘휴흉흐흑흔흘흙흠흡흥흩희흰히힉힌힐힘힙힛힝"sv,
// Kanji
"一右雨円王音下火花貝学気九休玉金空月犬見五口校左三山子四糸字耳七車手十出女小上森人水正生青夕石赤千川先早草足村大男竹中虫町天田土二日入年白八百文木本名目立力六林"sv,
"引羽雲園遠何科夏家歌画回会海絵外角楽活間丸岩顔汽記帰弓牛魚京強教近兄形計元言原戸古午後語工公広交光考行高黄合谷国黒今才細作算止市矢姉思紙寺自時室社弱首秋週春書少場色食心新親図数西声星晴切雪船線前組走多太体台地池知茶昼長鳥朝通弟店点電冬刀東当答頭同道読内南肉馬売買麦半番父風分聞米歩母方北妹毎万明鳴毛門夜野友用曜来里理話"sv,
"悪安暗医委意育員院飲運泳駅央横屋温化荷界開階寒感漢館岸起期客究急級宮球去橋業曲局銀区苦具君係軽血決研県庫湖向幸港号根祭皿仕死使始指歯詩次事持式実写者主守取酒受州拾終習集住重宿所暑助昭消商章勝乗植申身神真深進世整昔全相送想息速族他打対待代第題炭短談着注柱丁帳調追定庭笛鉄転都度投豆島湯登等動童農波配倍箱畑発反坂板皮悲美鼻筆氷表秒病品負部服福物平返勉放味命面問役薬由油有遊予羊洋葉陽様落流旅両緑礼列練路和"sv,
"愛案以衣囲胃印英栄塩億加果貨課芽改械害街各覚完官管関観願希季紀喜旗器機議求泣救給挙漁共協鏡競極訓軍郡径型景芸欠結建健験固功好候航康告差菜最材昨札刷殺察参産散残士氏史司試児治辞失借種周祝順初松笑唱焼象照賞臣信成省清静席積折節説浅戦選然争倉巣束側続卒孫帯隊達単置仲貯兆腸低底停的典伝徒努灯堂働特得毒熱念敗梅博飯飛費必票標不夫付府副粉兵別辺変便包法望牧末満未脈民無約勇要養浴利陸良料量輪類令冷例歴連老労録"sv,
"圧移因永営衛易益液演応往桜恩可仮価河過快賀解格確額刊幹慣眼基寄規技義逆久旧居許境均禁句群経潔件券険検限現減故個護効厚耕鉱構興講混査再災妻採際在財罪雑酸賛支志枝師資飼示似識質舎謝授修述術準序招承証条状常情織職制性政勢精製税責績接設舌絶銭祖素総造像増則測属率損退貸態団断築張提程適敵統銅導徳独任燃能破犯判版比肥非備俵評貧布婦富武復複仏編弁保墓報豊防貿暴務夢迷綿輸余預容略留領"sv,
"異遺域宇映延沿我灰拡革閣割株干巻看簡危机揮貴疑吸供胸郷勤筋系敬警劇激穴絹権憲源厳己呼誤后孝皇紅降鋼刻穀骨困砂座済裁策冊蚕至私姿視詞誌磁射捨尺若樹収宗就衆従縦縮熟純処署諸除将傷障城蒸針仁垂推寸盛聖誠宣専泉洗染善奏窓創装層操蔵臓存尊宅担探誕段暖値宙忠著庁頂潮賃痛展討党糖届難乳認納脳派拝背肺俳班晩否批秘腹奮並陛閉片補暮宝訪亡忘棒枚幕密盟模訳郵優幼欲翌乱卵覧裏律臨朗論"sv,
"譜面鍵盤狂姫帝神魔轟撃乱難易"sv
});

}
