/*
Copyright (c) 2026 Tearnote (Hubert Maraszek)

Licensed under the Mozilla Public License Version 2.0 <LICENSE-MPL-2.0.txt
or https://www.mozilla.org/en-US/MPL/2.0/> or the Boost Software License <LICENSE-BSL-1.0.txt
or https://www.boost.org/LICENSE_1_0.txt>, at your option. This file may not be copied, modified,
or distributed except according to those terms.
*/

#pragma once

#include "preamble.hpp"

namespace playnote::gfx {

static inline constexpr auto AtlasPrewarmChars = to_array({
// Latin alphanumerics and punctuation
"abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789 !@#$%^&*()_+=-[]{};':\",./\\<>?`~|"sv,
// Fullwidth alphanumerics and punctuation
"ＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚ０１２３４５６７８９、。，．・：；？！゛゜´｀¨＾＿ヽヾゝゞ〃々〆ー―／＼～｜（）〔〕［］｛｝〈〉《》「」『』【】"sv,
// Hiragana
"ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをんゔ"sv,
// Katakana
"ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴヵヶ"sv,
// Kanji
"一右雨円王音下火花貝学気九休玉金空月犬見五口校左三山子四糸字耳七車手十出女小上森人水正生青夕石赤千川先早草足村大男竹中虫町天田土二日入年白八百文木本名目立力林六引羽雲園遠何科夏家歌画回会海絵外角楽活間丸岩顔汽記帰弓牛魚京強教近兄形計元言原戸古午後語工公広交光考行高黄合谷国黒今才細作算止市矢姉思紙寺自時室社弱首秋週春書少場色食心新親図数西声星晴切雪船線前組走多太体台地池知茶昼長鳥朝直通弟店点電冬刀東当答頭同道読内南肉馬売買麦半番父風分聞米歩母方北毎妹万明鳴毛門夜野友用曜来里理話"sv,
"悪安暗医委意育員院飲運泳駅央横屋温化荷界開階寒感漢館岸起期客究急級宮球去橋業曲局銀区苦具君係軽血決研県庫湖向幸港号根祭皿仕死使始指歯詩次事持式実写者主守取酒受州拾終習集住重宿所暑助昭消商章勝乗植申身神真深進世整昔全相送想息速族他打対待代第題炭短談着注柱丁帳調追定庭笛鉄転都度投豆島湯登等動童農波配倍箱畑発反坂板皮悲美鼻筆氷表秒病品負部服福物平返勉放味命面問役薬由油有遊予羊洋葉陽様落流旅両緑礼列練路和"sv,
"愛案以衣位囲胃印英栄塩加果貨課芽改械害街各覚完官管関観願希季紀喜旗器機議求泣救給挙共協鏡競極訓軍型景芸欠結建健験固功好候航康告差最材昨殺察参産散残士氏史司試児治辞失借種周祝順初松笑唱焼象照賞臣信成省清静席積折節説浅戦選然争側続卒達単置仲貯兆低底停的典伝徒努灯堂働特得熱念敗梅博飯飛費必票標不夫付府副粉兵別辺変便包法望末満未民無約勇要養浴利陸良料量輪類令冷例歴連老労録"sv,
"圧移因永営衛易益液演応往桜恩可仮価河過快賀解格確刊幹慣眼基寄規技義逆久旧居許境均禁句群経潔件券険検限現減故個護効厚耕構興講混査再災採際在財罪雑酸賛支志枝師資示似識質舎謝授修述術準序招承証条状常情織職制性政勢精製税責績接設絶銭祖素総造像増則測属率損退態団断築張提程適敵統導独任燃能破判版比肥非備評貧布婦富武復複仏編弁保墓報豊防貿暴務夢迷綿輸余預容略留領"sv,
"異遺域宇映延沿我灰拡革閣割株干巻看簡危揮貴疑吸供胸郷勤筋系敬警劇激穴猫権憲源厳己呼誤俺僕皇紅降鋼刻恋骨困砂座済裁策冊至私姿視詞誌磁射捨尺若樹収宗就衆従縦縮熟純処署諸除将傷障城蒸針仁垂推寸盛聖誠宣専泉洗染善奏窓創装層操存尊宅担探誕段暖値宙忠著庁頂潮賃痛展討糖届難乳認納脳派拝背肺班晩否批秘腹奮並龍閉片補暮宝訪亡忘棒枚幕密盟模訳郵優幼欲翌乱卵覧裏律臨論譜鍵超抜"sv,
// Hangul
"가각간갈감갑강개객거건걸검겁것게겨격견결경계고곡곤골곰곱공과관광괜교구국군굴궁권귀규균그극근글금급기긴길김나난날남낮내냉너넌널넓넘네녀년념노논놀농높놓누눈늘능니닐님다단달담답당대댐더덕던덜덤덥데도독돈돌동되된두둘둥뒤드득든들듬듭등디따딴딸땀땅때떠떡떨떼또뚜뛰뜨뜻띠라란람랑래랜램랭러런럴럼렁레렌려력련렬령례로론롤롬롱료룡루룬룰룸류륜률르른를름리린릴림립링마막만많말맑맘망맞매맥맨맵머먹먼멀멈멍메며면멸명모목몬몰몸못몽묘무문물뭄뭐미민믿밀밈밑"sv,
"바박반받발밝밤밥방배백뱀뱅버번벌범법벗베벨벽변별병보본볼봄봇봉부북분불붉붐붕뷰브블비빌빔빗빙빛사삭산살삼상새색샌샘생서석선설섬섭성세센셀셈션소속손솔솜송쇄쇠쇼수숙순술숨숭쉬쉴쉽스슬습승시식신실심십싱아악안않알암압앙앞애액앨앰앵야약양얘어언얼업없었엉에엔엘엠엥여역연열염영예오옥온올옮옴옵옷옹와완왕왜외요욕용우운울움웁원월위유육윤율으은을음응의이익인일읽임입있잉자작잔잘잠잡장재쟁저적전절점접정제조족존졸좀종좋좌주죽준줄줌중쥐즈즉즐즘증지직진질짐집징"sv,
"차착찬찰참창채책챙처척천철첨청체초촉총최추축춘출춤충취측층치친칠침칭하학한할함합항해핵행향허헌험헤혀현혈형혜호혹혼홀홍화확환활황회획효후훈훨휘휴흐흔흥희히힘까깨꺼께꼬꽈꽤꾸끄끼따때떠떼또뚜뜨띠빠빼뻐뻬뽀뿌쁘삐싸쌔써쎄쏘쑤쓰씨짜째쩌쩨쪼쭈쯔찌"sv,
});

}
