/*
Copyright (c) 2025 Tearnote (Hubert Maraszek)

Licensed under the Mozilla Public License Version 2.0 <LICENSE-MPL-2.0.txt
or https://www.mozilla.org/en-US/MPL/2.0/> or the Boost Software License <LICENSE-BSL-1.0.txt
or https://www.boost.org/LICENSE_1_0.txt>, at your option. This file may not be copied, modified,
or distributed except according to those terms.
*/

#pragma once

#include "preamble.hpp"

namespace playnote::gfx {

static inline constexpr auto AtlasPrewarmChars = to_array({
// Latin alphanumerics
"abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789"sv,
// Latin punctuation
" !@#$%^&*()_+=-[]{};':\",./\\<>?`~|"sv,
// Latin supplement
"¡¢£€¤¥¦§¨©ª«¬®¯°±²³´µ¶·¸¹º»¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõö÷øùúûüýþÿ"sv,
// Greek
"ΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩαβγδεζηθικλμνξοπρστυφχψω"sv,
// Cyrillic
"АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя"sv,
// General symbols
"†‡™℠№♩♪♫♬♭♮♯♡♥♠♣♦←↑→↓↔↕↖↗↘↙∂∇∏∑−√∞∫≈≠≤≥"sv,
// Fullwidth alphanumerics
"ＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚ０１２３４５６７８９"sv,
// Fullwidth punctuation
"、。，．・：；？！゛゜´｀¨＾￣＿ヽヾゝゞ〃仝々〆〇ー―‐／＼～∥｜…‥‘’“”（）〔〕［］｛｝〈〉《》「」『』【】＋－±×÷＝≠＜＞≦≧∞∴♂♀°′″℃￥＄￠￡％＃＆＊＠§☆★○●◎◇◆□■△▲▽▼※〒→←↑↓〓"sv,
// Hiragana
"ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをんゔ"sv,
// Katakana
"ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴヵヶ"sv,
// Kanji
"一右雨円王音下火花貝学気九休玉金空月犬見五口校左三山子四糸字耳七車手十出女小上森人水正生青夕石赤千川先早草足村大男竹中虫町天田土二日入年白八百文木本名目立力林六引羽雲園遠何科夏家歌画回会海絵外角楽活間丸岩顔汽記帰弓牛魚京強教近兄形計元言原戸古午後語工公広交光考行高黄合谷国黒今才細作算止市矢姉思紙寺自時室社弱首秋週春書少場色食心新親図数西声星晴切雪船線前組走多太体台地池知茶昼長鳥朝直通弟店点電冬刀東当答頭同道読内南肉馬売買麦半番父風分聞米歩母方北毎妹万明鳴毛門夜野友用曜来里理話"sv,
"悪安暗医委意育員院飲運泳駅央横屋温化荷界開階寒感漢館岸起期客究急級宮球去橋業曲局銀区苦具君係軽血決研県庫湖向幸港号根祭皿仕死使始指歯詩次事持式実写者主守取酒受州拾終習集住重宿所暑助昭消商章勝乗植申身神真深進世整昔全相送想息速族他打対待代第題炭短談着注柱丁帳調追定庭笛鉄転都度投豆島湯登等動童農波配倍箱畑発反坂板皮悲美鼻筆氷表秒病品負部服福物平返勉放味命面問役薬由油有遊予羊洋葉陽様落流旅両緑礼列練路和"sv,
"愛案以衣位囲胃印英栄塩億加果貨課芽改械害街各覚完官管関観願希季紀喜旗器機議求泣救給挙漁共協鏡競極訓軍郡径型景芸欠結建健験固功好候航康告差菜最材昨札刷殺察参産散残士氏史司試児治辞失借種周祝順初松笑唱焼象照賞臣信成省清静席積折節説浅戦選然争倉巣束側続卒孫帯隊達単置仲貯兆腸低底停的典伝徒努灯堂働特得毒熱念敗梅博飯飛費必票標不夫付府副粉兵別辺変便包法望牧末満未脈民無約勇要養浴利陸良料量輪類令冷例歴連老労録"sv,
"圧移因永営衛易益液演応往桜恩可仮価河過快賀解格確額刊幹慣眼基寄規技義逆久旧居許境均禁句群経潔件券険検限現減故個護効厚耕鉱構興講混査再災妻採際在財罪雑酸賛支志枝師資飼示似識質舎謝授修述術準序招承証条状常情織職制性政勢精製税責績接設舌絶銭祖素総造像増則測属率損退貸態団断築張提程適敵統努土党導独任燃能破判版比肥非備俵評貧布婦富武復複仏編弁保墓報豊防貿暴務夢迷綿輸余預容略留領"sv,
"異遺域宇映延沿我灰拡革閣割株干巻看簡危机揮貴疑吸供胸郷勤筋系敬警劇激穴絹権憲源厳己呼誤后孝皇紅降鋼刻穀骨困砂座済裁策冊蚕至私姿視詞誌磁射捨尺若樹収宗就衆従縦縮熟純処署諸除将傷障城蒸針仁垂推寸盛聖誠宣専泉洗染善奏窓創装層操蔵臓存尊宅担探誕段暖値宙忠著庁頂潮賃痛展討党糖届難乳認納脳派拝背肺俳班晩否批秘腹奮並陛閉片補暮宝訪亡忘棒枚幕密盟模訳郵優幼欲翌乱卵覧裏律臨朗論"sv,
"譜鍵盤択戻了更鬼魔狂姫響壱弐遅押離普妙込枠扱抜誰即幅"sv,
// Hangul
"가각간갇갈감갑값갓갔강갖개객거건걷걸검겁것겉게겨격견결겸경계고곡곤곧골곰곱곳공과관광괜괴교구국군굳굴굵굶굽굿궁권귀규균그극근글긁금급긋긍기긴길김깊"sv,
"나낙난날남납낫났낭낮낯낱낳내냄냇냉냐냥너넉넌널넓넘넣네넷녀년념녕노녹논놀놈농높놓뇌뇨누눈눌눕느늑는늘늙능늦니닐님"sv,
"다닦단닫달닭닮담답닷당닿대댁댐더덕던덜덤덥덧덩덮데델도독돈돌돕동돼되된될됨두둑둔둘둠둡둥뒤뒷드득든듣들듬듭듯등디딜딥"sv,
"따딱딴딸땀땅때떠떡떨떻떼또똑똥뚜뚝뚫뛰뜨뜻띠"sv,
"라락란랄람랍랏랑래랙랜램랩랫랭랴략량러럭런럴럼럽럿렁레렉렌렐렘렙렛렝려력련렬렴렵렷령례로록론롤롬롭롯롱뢰료룡루룩룬룰룸룹룻룽류륙륜률륭르륵른를름릅릉리릭린릴림립릿링"sv,
"마막만많말맑맘맙맛망맞맡맣매맥맨맵맺머먹먼멀멈멋멍메멘멩며면멸명몇모목몫몬몰몸몹못몽묘무묵문묻물뭄뭇뭉뭐뭘미민믿밀밈밉밋밌밑"sv,
"바박밖반받발밝밟밤밥밧방밭배백뱀뱃뱅버벅번벌범법벗벙베벨벼벽변별병보복본볼봄봅봇봉봐봤뵈부북분불붉붐붓붕붙뷰브블비빌빔빕빗빙빚빛"sv,
"빠빡빨빵빼뻐뼈뽀뽑뿌뿐쁘삐"sv,
"사삭산살삶삼삽삿샀상새색샌샐샘샛생샤서석섞선설섬섭섯섰성세섹센셀셈셉셋셌셍셔션셜셨셰소속손솔솜솟송쇄쇠쇼수숙순술숨숫숭숲쉬쉴쉽슈스슬슴습승시식신실싫심십싯싱싶"sv,
"싸싹싼쌀쌈쌍쌓써썩썰쎄쏘쏟쑤쓰쓸씌씨씩씬"sv,
"아악안앉않알앎앓암압앗았앙앞애액앨앰앱앵야약양얕얘어억언얹얻얼엄업없엇었엉엊에엑엔엘엠엡엣엥여역연열염엽엿였영옆예옛오옥온올옮옳옴옵옷옹와완왔왕왜왠외왼요욕용우욱운울움웁웃웅워원월웨웬위윗유육윤율융으윽은을읊음읍응의이익인일읽잃임입잇있잉잊잎"sv,
"자작잔잘잠잡잣장잦재쟁저적전절젊점접젓정젖제젠젯져조족존졸좀좁종좋좌죄주죽준줄줌줍중쥐즈즉즐즘즙증지직진질짐집짓징짖짚"sv,
"짜짝짧째쩌쪽쯤찌찍"sv,
"차착찬찮찰참찹찻창찾채책챙처척천철첨첩첫청체쳐쳤초촉촌총최추축춘출춤춥충취츠측층치칙친칠침칩칭"sv,
"카칵칸칼캄캅캉캐캔캠캡커컥컨컬컴컵컷케켓켜코콕콘콜콤콩쾌쿠쿡쿨쿵쿼퀘퀴큐크큰클큼키킥킨킬킹"sv,
"타탁탄탈탐탑탓탕태택탠탬탭탱터턱턴털텀텄테텍텐텔템텝테텨토톡톤톨톰톱통퇴투툭퉁튀튜트특튼틀틈티틱틴틸팀팁"sv,
"파팍판팔팜팝팟팡팥패팩팬팰팸팽퍼퍽펀펄펌펑페펙펜펠펨펩펭펴편펼평폐포폭폰폴폼표푸푹풀품풍퓨프플픔피픽핀필핌핍핑"sv,
"하학한할함합항해핵핸햄햇행향허헉헌헐험헛헤헬헷혀혁현혈혐협형혜호혹혼홀홈홉홍화확환활황홰회획횟횡효후훅훈훌훔훗훼휘휴흉흐흑흔흘흙흠흡흥흩희흰히힉힌힘힙"sv,
});

}
